In [1]:
f=[ 1, 3, 2, 2, 3, 1, 5, 7, 8, 9, 16, 18, 22, 3, 2 ]

In [13]:
a=sorted(list(set(f)))

In [16]:
s=a[::-1]

In [18]:
s

[22, 18, 16, 9, 8, 7, 5, 3, 2, 1]

In [ ]:
s[2]

In [17]:
for i in range(len(s)):
   # print({}"th largest eliment is - "{}.format((i+1),a[i]))
    print(str(i+1) + "th largest eliment is"+ str(s[i]))

1th largest eliment is22
2th largest eliment is18
3th largest eliment is16
4th largest eliment is9
5th largest eliment is8
6th largest eliment is7
7th largest eliment is5
8th largest eliment is3
9th largest eliment is2
10th largest eliment is1

In [19]:
import pandas as pd
department_lst = ['Tech', 'Tech', 'Support', 'Support', 'Support']
employee_lst = ['Shay Henry', 'John Doe', 'Brad Snow', 'Tima Elhaj', 'Henry Shawn']
salary_lst = [300, 400, 200, 100, 50]
df = pd.DataFrame()
df['Department'] = department_lst
df['Employee'] = employee_lst
df['Salary'] = salary_lst
df

  Department     Employee  Salary
0       Tech   Shay Henry     300
1       Tech     John Doe     400
2    Support    Brad Snow     200
3    Support   Tima Elhaj     100
4    Support  Henry Shawn      50

In [24]:
df.groupby(['Department'])['Salary'].max()

Department
Support    200
Tech       400
Name: Salary, dtype: int64

In [ ]:
df.sort(by=)

In [27]:
df.drop_duplicates('Department',keep='first')

  Department    Employee  Salary
0       Tech  Shay Henry     300
2    Support   Brad Snow     200

In [ ]:
select Department,employee, max(salary) from <table_name> groupby Department;

In [ ]:
Table1:
Name
A
A
B
 
Table 2:
Name
A
B